experiments/workflow/boki-movie/expected_results/qps50/wrk.log
Running 2m test @ http://ip-172-31-6-74.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 0.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.037ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.87ms    8.10ms  45.44ms   95.83%
    Req/Sec    26.08     47.49   222.00     75.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.22ms
 75.000%    1.48ms
 90.000%    1.65ms
 99.000%   41.47ms
 99.900%   45.44ms
 99.990%   45.47ms
 99.999%   45.47ms
100.000%   45.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.247     0.000000            1         1.00
       0.761     0.100000          700         1.11
       0.888     0.200000         1400         1.25
       0.968     0.300000         2100         1.43
       1.074     0.400000         2801         1.67
       1.216     0.500000         3501         2.00
       1.263     0.550000         3852         2.22
       1.306     0.600000         4206         2.50
       1.357     0.650000         4553         2.86
       1.419     0.700000         4899         3.33
       1.477     0.750000         5250         4.00
       1.506     0.775000         5426         4.44
       1.532     0.800000         5600         5.00
       1.561     0.825000         5775         5.71
       1.585     0.850000         5951         6.67
       1.619     0.875000         6125         8.00
       1.638     0.887500         6211         8.89
       1.654     0.900000         6300        10.00
       1.670     0.912500         6396        11.43
       1.684     0.925000         6476        13.33
       1.710     0.937500         6562        16.00
       1.743     0.943750         6607        17.78
       1.766     0.950000         6650        20.00
       2.167     0.956250         6692        22.86
      41.439     0.962500         6868        26.67
      41.439     0.968750         6868        32.00
      41.439     0.971875         6868        35.56
      41.439     0.975000         6868        40.00
      41.439     0.978125         6868        45.71
      41.439     0.981250         6868        53.33
      41.471     0.984375         6984        64.00
      41.471     0.985938         6984        71.11
      41.471     0.987500         6984        80.00
      41.471     0.989062         6984        91.43
      41.471     0.990625         6984       106.67
      41.471     0.992188         6984       128.00
      41.471     0.992969         6984       142.22
      41.471     0.993750         6984       160.00
      41.471     0.994531         6984       182.86
      41.471     0.995313         6984       213.33
      41.471     0.996094         6984       256.00
      41.471     0.996484         6984       284.44
      41.471     0.996875         6984       320.00
      41.471     0.997266         6984       365.71
      41.471     0.997656         6984       426.67
      45.439     0.998047         6992       512.00
      45.439     0.998242         6992       568.89
      45.439     0.998437         6992       640.00
      45.439     0.998633         6992       731.43
      45.439     0.998828         6992       853.33
      45.439     0.999023         6992      1024.00
      45.439     0.999121         6992      1137.78
      45.471     0.999219         6998      1280.00
      45.471     1.000000         6998          inf
#[Mean    =        2.868, StdDeviation   =        8.099]
#[Max     =       45.440, Total count    =         6998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  221.00us
 75.000%  258.00us
 90.000%  284.00us
 99.000%   40.67ms
 99.900%   44.67ms
 99.990%   44.74ms
 99.999%   44.80ms
100.000%   44.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.152     0.000000            1         1.00
       0.184     0.100000          745         1.11
       0.194     0.200000         1475         1.25
       0.202     0.300000         2181         1.43
       0.210     0.400000         2841         1.67
       0.221     0.500000         3526         2.00
       0.228     0.550000         3876         2.22
       0.235     0.600000         4213         2.50
       0.243     0.650000         4557         2.86
       0.251     0.700000         4924         3.33
       0.258     0.750000         5251         4.00
       0.262     0.775000         5441         4.44
       0.266     0.800000         5644         5.00
       0.269     0.825000         5782         5.71
       0.273     0.850000         5956         6.67
       0.278     0.875000         6150         8.00
       0.280     0.887500         6215         8.89
       0.284     0.900000         6331        10.00
       0.286     0.912500         6389        11.43
       0.290     0.925000         6474        13.33
       0.296     0.937500         6571        16.00
       0.299     0.943750         6611        17.78
       0.305     0.950000         6653        20.00
       0.318     0.956250         6694        22.86
      40.447     0.962500         6736        26.67
      40.511     0.968750         6780        32.00
      40.543     0.971875         6809        35.56
      40.575     0.975000         6830        40.00
      40.607     0.978125         6872        45.71
      40.607     0.981250         6872        53.33
      40.639     0.984375         6918        64.00
      40.639     0.985938         6918        71.11
      40.639     0.987500         6918        80.00
      40.671     0.989062         6949        91.43
      40.671     0.990625         6949       106.67
      40.671     0.992188         6949       128.00
      40.671     0.992969         6949       142.22
      40.703     0.993750         6969       160.00
      40.703     0.994531         6969       182.86
      40.703     0.995313         6969       213.33
      40.735     0.996094         6978       256.00
      40.735     0.996484         6978       284.44
      40.735     0.996875         6978       320.00
      40.767     0.997266         6984       365.71
      40.767     0.997656         6984       426.67
      44.447     0.998047         6985       512.00
      44.511     0.998242         6986       568.89
      44.543     0.998437         6988       640.00
      44.575     0.998633         6989       731.43
      44.639     0.998828         6990       853.33
      44.671     0.999023         6993      1024.00
      44.671     0.999121         6993      1137.78
      44.671     0.999219         6993      1280.00
      44.703     0.999316         6996      1462.86
      44.703     0.999414         6996      1706.67
      44.703     0.999512         6996      2048.00
      44.703     0.999561         6996      2275.56
      44.703     0.999609         6996      2560.00
      44.703     0.999658         6996      2925.71
      44.703     0.999707         6996      3413.33
      44.735     0.999756         6997      4096.00
      44.735     0.999780         6997      4551.11
      44.735     0.999805         6997      5120.00
      44.735     0.999829         6997      5851.43
      44.735     0.999854         6997      6826.67
      44.799     0.999878         6998      8192.00
      44.799     1.000000         6998          inf
#[Mean    =        1.917, StdDeviation   =        8.109]
#[Max     =       44.768, Total count    =         6998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7502 requests in 2.50m, 1.17MB read
Requests/sec:     50.01
Transfer/sec:      7.96KB