experiments/workflow/boki-movie/expected_results/qps50/wrk_warmup.log
Running 30s test @ http://ip-172-31-6-74.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 0.921ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.898ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  321.01us   1.74ms   61.82%
    Req/Sec    26.08     45.12   111.00     74.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.33ms
 90.000%    1.50ms
 99.000%    1.64ms
 99.900%    1.70ms
 99.990%    1.74ms
 99.999%    1.74ms
100.000%    1.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.268     0.000000            1         1.00
       0.652     0.100000          100         1.11
       0.761     0.200000          200         1.25
       0.889     0.300000          300         1.43
       0.983     0.400000          400         1.67
       1.052     0.500000          500         2.00
       1.095     0.550000          549         2.22
       1.147     0.600000          599         2.50
       1.223     0.650000          649         2.86
       1.262     0.700000          700         3.33
       1.327     0.750000          749         4.00
       1.357     0.775000          774         4.44
       1.389     0.800000          800         5.00
       1.422     0.825000          824         5.71
       1.453     0.850000          850         6.67
       1.477     0.875000          875         8.00
       1.493     0.887500          888         8.89
       1.505     0.900000          899        10.00
       1.516     0.912500          911        11.43
       1.527     0.925000          924        13.33
       1.539     0.937500          936        16.00
       1.545     0.943750          942        17.78
       1.560     0.950000          949        20.00
       1.568     0.956250          955        22.86
       1.583     0.962500          962        26.67
       1.601     0.968750          968        32.00
       1.605     0.971875          970        35.56
       1.607     0.975000          974        40.00
       1.609     0.978125          977        45.71
       1.617     0.981250          980        53.33
       1.624     0.984375          983        64.00
       1.626     0.985938          984        71.11
       1.638     0.987500          986        80.00
       1.642     0.989062          988        91.43
       1.643     0.990625          989       106.67
       1.647     0.992188          991       128.00
       1.647     0.992969          991       142.22
       1.650     0.993750          992       160.00
       1.654     0.994531          993       182.86
       1.660     0.995313          994       213.33
       1.668     0.996094          995       256.00
       1.668     0.996484          995       284.44
       1.668     0.996875          995       320.00
       1.681     0.997266          996       365.71
       1.681     0.997656          996       426.67
       1.695     0.998047          997       512.00
       1.695     0.998242          997       568.89
       1.695     0.998437          997       640.00
       1.695     0.998633          997       731.43
       1.695     0.998828          997       853.33
       1.736     0.999023          998      1024.00
       1.736     1.000000          998          inf
#[Mean    =        1.065, StdDeviation   =        0.321]
#[Max     =        1.736, Total count    =          998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  211.00us
 75.000%  247.00us
 90.000%  273.00us
 99.000%  305.00us
 99.900%  327.00us
 99.990%  334.00us
 99.999%  334.00us
100.000%  334.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.145     0.000000            2         1.00
       0.165     0.100000          108         1.11
       0.173     0.200000          206         1.25
       0.183     0.300000          302         1.43
       0.194     0.400000          405         1.67
       0.211     0.500000          500         2.00
       0.219     0.550000          554         2.22
       0.227     0.600000          601         2.50
       0.233     0.650000          649         2.86
       0.241     0.700000          700         3.33
       0.247     0.750000          750         4.00
       0.252     0.775000          777         4.44
       0.256     0.800000          800         5.00
       0.260     0.825000          828         5.71
       0.264     0.850000          851         6.67
       0.269     0.875000          874         8.00
       0.272     0.887500          894         8.89
       0.273     0.900000          900        10.00
       0.275     0.912500          911        11.43
       0.280     0.925000          926        13.33
       0.285     0.937500          939        16.00
       0.287     0.943750          945        17.78
       0.289     0.950000          950        20.00
       0.291     0.956250          955        22.86
       0.293     0.962500          961        26.67
       0.295     0.968750          967        32.00
       0.296     0.971875          970        35.56
       0.298     0.975000          977        40.00
       0.298     0.978125          977        45.71
       0.300     0.981250          981        53.33
       0.301     0.984375          983        64.00
       0.302     0.985938          985        71.11
       0.305     0.987500          988        80.00
       0.305     0.989062          988        91.43
       0.306     0.990625          989       106.67
       0.314     0.992188          991       128.00
       0.314     0.992969          991       142.22
       0.315     0.993750          992       160.00
       0.316     0.994531          993       182.86
       0.318     0.995313          994       213.33
       0.319     0.996094          995       256.00
       0.319     0.996484          995       284.44
       0.319     0.996875          995       320.00
       0.320     0.997266          996       365.71
       0.320     0.997656          996       426.67
       0.327     0.998047          997       512.00
       0.327     0.998242          997       568.89
       0.327     0.998437          997       640.00
       0.327     0.998633          997       731.43
       0.327     0.998828          997       853.33
       0.334     0.999023          998      1024.00
       0.334     1.000000          998          inf
#[Mean    =        0.215, StdDeviation   =        0.042]
#[Max     =        0.334, Total count    =          998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1502 requests in 30.00s, 239.09KB read
Requests/sec:     50.06
Transfer/sec:      7.97KB